<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b15bfdd0387b0aca7f60aa2aa43cfe09ebbb68f27c2d82edb26082c984e8243a","plan_job_ref":"Job Terraform plan #43 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8145531669","plan_out_hash":"43e4f55fc445523e0462306f87d916ee0685511c91af46dc6775af274aed1638","plan_hash":"c4933b3a34ab8d2a97a201e5c83cf2657013f1720babddbac24d7f4ca28a871c","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
api_registry        = "crpoec718rf5704ehe0c"
api_repository      = "api"
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
github_sha          = "9f103e3a49f398d0a3ad5b572023ff74b8f9440d"
```
</details>
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                 = "d4ef136o48bqjg3sv4q7"
        name               = "receive-video-handler"
        tags               = []
!~      user_hash          = "82635be28d61b98735116f9738681e7da0caaad029bf71d7d97b05b78b5f8174" -> "f804066b583b0d524b35c991b4b5416cf71b24a7e8f3c427ee9a9baae02eebd4"
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_serverless_container.test-container will be created
+   resource "yandex_serverless_container" "test-container" {
+       core_fraction      = (known after apply)
+       cores              = 1
+       created_at         = (known after apply)
+       execution_timeout  = (known after apply)
+       folder_id          = (known after apply)
+       id                 = (known after apply)
+       memory             = 128
+       name               = "api"
+       revision_id        = (known after apply)
+       service_account_id = "********************"
+       url                = (known after apply)

+       image {
+           digest = (known after apply)
+           url    = "cr.yandex/crpoec718rf5704ehe0c/api:9f103e3a49f398d0a3ad5b572023ff74b8f9440d"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #26](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8145586239)